#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//指针
// 内存（空间）相似  现实生活中空间的使用
// 1.内存是怎么编号的
// 2.一个内存单元是多大空间
// 
// 32位计算机-32根地址线-物理线-通电-1/0
// （电信号转换成数字信息：1和0组成的的二进制序列）
// 000000000000000000000000000000
// ......
// 011111111111111111111111111111
// 100000000000000000000000000000
// ......
// 111111111111111111111111111111
// 将上面的这种二进制序列作为内存编号称为内存单元的地址（共有2^32）
// 一个内存单元是一个字节！
// 64位
//
//int main()
//{
//	int a = 10; //a在内存中要分配空间 -4 个字节
//	//&a 取出的是第一个字节的地址
//	printf("%p\n", &a); //%p专门用来打印地址的
//	int * pa = &a;//pa是用来存放地址的，在c语言中pa就是指针变量
//	//*说明pa是指针变量
//	//int说明pa执行的对象是int型的
//
//	char ch = 'w';
//	char * pc = &ch;
//
//	return 0;
//}

//---------------------------------------------
//int main() {
//	int* a = &a;
//
//	return;
//}

//
//int main()
//{
//	int a = 10;
//	int* pa = &a;
//	*pa = 20;//*叫做解引用操作，*pa就是通过pa里面的地址找到a
//	printf("%d\n", a);
//
//
//	return 0;
//}



//指针变量的大小

int main()
{
	printf("%d\n", sizeof(char*));
	printf("%d\n", sizeof(short*));
	printf("%d\n", sizeof(int*));
	printf("%d\n", sizeof(long*));
	printf("%d\n", sizeof(double*));
	printf("%d\n", sizeof(float*));
	printf("%d\n", sizeof(long long*));
	//指针大小是相同的
	//原因
	//指针是用来存放地址的！
	// 指针需要多大空间，取决于地址的存储需要多大空间
	// 32位    32bit    4byte
	// 64位    64bit    8byte
	//
	return 0;
}


