#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//-----------------------------数组------------------------------
//一组相同元素类型的集合
//数组的创建
//    type_t        arr_name    [const_n]
//数组元素类型     数组名       常量表达式，用来指定数组大小
//

//int main()
//{
//	//int arr[8];
//	//char ch[5];
//	//int a = 0;//初始化
//	////int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//完全初始化
//	//int arr[10] = { 1,2,3,4,5 };//不完全初始化
//	//int arr[] = { 1,2,3,4,5 };//根据后面初始化内容确定数组大小
//
//	//char ch1[5] = { 'b','i','t' };
//	//char ch2[] = { 'b','i','t' };   //三个元素
//	//char ch3[5] = "bit";
//	//char ch4[] = "bit";  //  四个元素              后面带了一个\0
//
//	return 0;
//}

//-----------------------数组操作符(下标应用操作符[])----------------------------
//
//int main()
//{
//	int arr[10] = { 0 };
//	arr[4] = 5;//[] - 下标引用操作符
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for ( i = 0; i < sz; i++)
//	{
//		printf("%d  ", arr[i]);
//	}
//
//	return 0;
//}


//-----------------一维数组在内存中的存储--------------------------
//%p - 是按地址的格式打印的 -- 16进制  补充前面的0
//%x  - 打印16进制  
//int main()
//{
//	int arr[10] = { 0 };
//	int i = 0;
//	for ( i = 0; i < 10; i++)
//	{
//		printf("&arr[%d] = %p\n",i, &arr[i]);  //打印地址利用%p
//	}
//	return 0;
//}

//一维数组在内存中连续存放的！
//随着数组下标的增长，地址是由低到高变化的！


//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* p = arr; //数组名就是数组首元素的地址
//	int i = 0;
//	for ( i = 0; i < 10; i++)
//	{
//		printf("%d ", *p);
//		p++;  //整型指针+1会跳过一个整型，字符指针和其他指针类似都是跳他的一个类型数据
//	}
//	return 0;
//}


//************************************************************************************************************************
//
// 
// -----------------------------   二维数组   ----------------------------------
//
//int main()
//{
	//二维数组的创建
	//int arr[3][4];//三行四列
	//char ch[3][10];
	//二维数组的初始化
	//初始化 -- 创建的同时赋值
	//int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
	//int arr[3][4] = { 1,2,3,4,5,6,7 };  //不完全初始化  ，后面补0
	//int arr[3][4] = { {1,2},{3,4},{4,5} };
	//int arr[][4] = { {1,2},{3,4},{4,5} };
	////二维数组行可以省略，列不能省略
	//int i = 0;
	//int j = 0;
	//for ( i = 0; i < 3; i++)
	//{
	//	for ( j = 0; j < 4; j++)
	//	{
	//		printf("%d  ", arr[i][j]);
	//	}
	//	printf("\n");
	//}
	//二维数组在内存中的存储
	//二维数组在内存中的存储也是连续的，同一行内连续，换行也连续
	//int arr[][4] = { {1,2},{3,4},{4,5} };

	//int i = 0;
	//int j = 0;
	//int* p = &arr[0][0];
	//for ( i = 0; i < 12; i++)
	//{
	//	//通过指针取得二维数组中的所有元素
	//	printf("%d ", *p);
	//	p++;
	//}
	//for ( i = 0; i < 3; i++)
	//{
	//	for ( j = 0; j < 4; j++)
	//	{
	//		printf("&arr[%d][%d] = %p\n", i, j ,& arr[i][j]);
	//	}

	//}

//	return 0;
//}

//------------------------   数组作为函数参数   ------------------
//void bubble_sort(int arr[],int len)  //arr本质是指针
//{
//
//	//冒泡排序
//	//1.确定趟数    
//	int i = 0;
//	int j = 0;
//	for ( i = 0; i < len-1; i++)
//	{
//		for ( j = 0; j < len-1-i; j++)
//		{
//			if (arr[j]>arr[j+1])
//			{
//				//交换
//				int tmp = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = tmp;
//			}
//		}
//	}
//}
//
//int main()
//{
//	int arr[] = { 9,8,7,6,5,4,3,2,1,0 };
//	//按升序排列  --  冒泡排序
//	int sz = sizeof(arr) / sizeof(arr[0]); //计算元素个数 
//	bubble_sort(arr,sz);   //数组传参本质传的是首元素的地址
//
//	return 0;
//}


//冒泡优化函数
//void bubble_sort(int arr[],int len)  //arr本质是指针
//{
//
//	//冒泡排序
//	//1.确定趟数    
//	int i = 0;
//	int j = 0;
//	int flag = 1;
//	for ( i = 0; i < len-1; i++)
//	{
//		for ( j = 0; j < len-1-i; j++)
//		{
//			if (arr[j]>arr[j+1])
//			{
//				//交换
//				int tmp = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = tmp;
//				flag = 0;
//			}
//		}
//		if (flag == 1)
//		{
//			break;
//		}
//	}
//}





//数组名是什么
//数组名是首元素的地址
//1.sizeof(数组名)  -  数组名表示整个数组  -  计算的是整个数组的大小单位是字节
//2.&数组名  -  数组名 表示整个数组 - 取得是整个数组的地址
//int main()
//{
//	int arr[10] = { 0 };
//	int sz = sizeof(arr);
//	printf("%p\n", &arr);   //取出的是数组的地址，可以用+1来验证
//	//printf("%p\n", &arr[0]);
//	printf("%p", arr);
//	//结果相同，调用数组名就是调用首元素的地址
//	return 0;
//}















