#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//-----------------------------数组------------------------------
//一组相同元素类型的集合
//数组的创建
//    type_t        arr_name    [const_n]
//数组元素类型     数组名       常量表达式，用来指定数组大小
//

//int main()
//{
//	//int arr[8];
//	//char ch[5];
//	//int a = 0;//初始化
//	////int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//完全初始化
//	//int arr[10] = { 1,2,3,4,5 };//不完全初始化
//	//int arr[] = { 1,2,3,4,5 };//根据后面初始化内容确定数组大小
//
//	//char ch1[5] = { 'b','i','t' };
//	//char ch2[] = { 'b','i','t' };   //三个元素
//	//char ch3[5] = "bit";
//	//char ch4[] = "bit";  //  四个元素              后面带了一个\0
//
//	return 0;
//}

//-----------------------数组操作符(下标应用操作符[])----------------------------
//
//int main()
//{
//	int arr[10] = { 0 };
//	arr[4] = 5;//[] - 下标引用操作符
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for ( i = 0; i < sz; i++)
//	{
//		printf("%d  ", arr[i]);
//	}
//
//	return 0;
//}


//-----------------一维数组在内存中的存储--------------------------
//%p - 是按地址的格式打印的 -- 16进制  补充前面的0
//%x  - 打印16进制  
//int main()
//{
//	int arr[10] = { 0 };
//	int i = 0;
//	for ( i = 0; i < 10; i++)
//	{
//		printf("&arr[%d] = %p\n",i, &arr[i]);  //打印地址利用%p
//	}
//	return 0;
//}

//一维数组在内存中连续存放的！
//随着数组下标的增长，地址是由低到高变化的！


int main()
{
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int* p = arr; //数组名就是数组首元素的地址
	int i = 0;
	for ( i = 0; i < 10; i++)
	{
		printf("%d ", *p);
		p++;  //整型指针+1会跳过一个整型，字符指针和其他指针类似都是跳他的一个类型数据
	}
	return 0;
}








