#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//操作符详解

//int main()
//{
//
//	//int a = 3 / 5;  //0.6
//	//printf("%d", a); //0
//	//float a = 6 / 5;
//	//printf("%f", a);  //1.00000
//
//	float a = 6 / 5.0;
//	printf("%f", a);   //1.20000
//
//	return 0;
//}


//int main()
//{
//	int a = 7 % 3;   //模(%)操作符两边必须是整数
//	printf("%d", a);  //1
//	return 0;
//}

//-----------------------移位操作符-------------------------

//int main()
//{
//	int a = 2;
//	//把a的二进制位向左移动一位
//	int b = a << 1;
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	//把a的二进制位向右移动一位
//	int b = a >> 1;
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	//把a的二进制位向右移动一位
//	int b = a >> 1;
//	printf("%d\n", a);
//	printf("%d\n", b);  //-1 说明是算数右移
//
//	return 0;
//}

//左移操作符---左边丢弃，右边补0
//右移操作符
//1.算数右移  ---  右边丢弃，左边补原符号位
//2.逻辑右移  ---  右边丢弃，左边补0


//-------------------------位操作符-----------------------------
//操作对象必须是整数
// 
//int main()
//{
//	int a = 3;
//	int b = 5;
//	////&  -  按(二进制)位与
//	////
//	//int c = a & b;
//	//printf("%d", c);  //1
//	////000000000000000000000000000000011
//	////000000000000000000000000000000101
//	////按位与的结果
//	////000000000000000000000000000000001
//
//	//  |   按(二进制)位或
//	//int c = a | b;
//	////000000000000000000000000000000011
//	////000000000000000000000000000000101
//	////按位或的结果
//	////000000000000000000000000000000111
//	//printf("%d", c); //7
//
//	//  ^  按位(二进制位)异或
//	//对应二进制位进行异或
//	//对应二进制位相同为0，相异为1
//	int c = a ^ b;
//	//000000000000000000000000000000011
//	//000000000000000000000000000000101
//	//按位异或的结果
//	//000000000000000000000000000000110
//	printf("%d", c); //6
//	return 0;
//}

//应用场景
//不创建第三个变量交换两个变量
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//交换
//	//printf("a = %d  b = %d\n", a, b);
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;  //数字太大会溢出
//	//printf("a = %d  b = %d\n", a, b);
//	//异或完成
//	printf("a = %d  b = %d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;  //数字太大会溢出
//	printf("a = %d  b = %d\n", a, b);
//
//	return 0;
//}



//编写代码；求一个整数存储在内存中的二进制中1的个数
//int main()
//{
//	int a = 13;
//	//把二进制中第5位变成1
//	a = a | (1 << 4);
//	a = a & ~(1 << 4);
//	printf("%d\n", a);
//	//00000000000000000000000000001101
//	//00000000000000000000000000000001
//	//00000000000000000000000000011101
//
//	return 0;
//}




//赋值操作符
//=  +=   -=   /=  >>=  %=等

//单目操作符   ----   只有一个操作数
//  ! 逻辑反
//  - 负值
//  + 正值
//  & 取地址
//  sizeof  操作数的类型长度(以字节为单位)
//  ~  对一个数的二进制按位取反
//  --  前置、后置减减
//  ++  前置、后置加加
//  *   简介访问操作符
// (类型)   强制类型转换
//


//int main()
//{
//	int a = 10;
//	//a = -a;
//	printf("%d", a);
//	return 0;
//}
 
//int main()
//{
//	short s = 5;
//	int a = 10;
//	//sizeof 中放的表达式,不参与运算
//	printf("%d\n", sizeof(s = a + 2));  //2
//	printf("%d\n", s);					//5
//	//int a = 10;
//	//int arr[10] = { 0 };
//	//printf("%zd\n", sizeof(a));   //4
//	//printf("%zd\n", sizeof(int));
//	////sizeof 是操作符,不是函数
//	//printf("%zd\n", sizeof a);  //4
//	//printf("%d\n", sizeof(arr));  //单位是字节  40
//	//printf("%d\n", sizeof(int[10]));  //40  -  int [10]是arr数组的类型
// 	return 0;
//}

//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001   --  原码
//	//11111111111111111111111111111110   --  反码
//	//11111111111111111111111111111111   --  补码
//	//~按位取反
//	int b = ~a;
//	//11111111111111111111111111111111
//	//~
//	//00000000000000000000000000000000
//	printf("b = %d\n", b);
//	printf("a = %d\n", a);
//
//	return 0;
//}















