#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//操作符详解

//int main()
//{
//
//	//int a = 3 / 5;  //0.6
//	//printf("%d", a); //0
//	//float a = 6 / 5;
//	//printf("%f", a);  //1.00000
//
//	float a = 6 / 5.0;
//	printf("%f", a);   //1.20000
//
//	return 0;
//}


//int main()
//{
//	int a = 7 % 3;   //模(%)操作符两边必须是整数
//	printf("%d", a);  //1
//	return 0;
//}

//-----------------------移位操作符-------------------------

//int main()
//{
//	int a = 2;
//	//把a的二进制位向左移动一位
//	int b = a << 1;
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	//把a的二进制位向右移动一位
//	int b = a >> 1;
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	//把a的二进制位向右移动一位
//	int b = a >> 1;
//	printf("%d\n", a);
//	printf("%d\n", b);  //-1 说明是算数右移
//
//	return 0;
//}

//左移操作符---左边丢弃，右边补0
//右移操作符
//1.算数右移  ---  右边丢弃，左边补原符号位
//2.逻辑右移  ---  右边丢弃，左边补0


//-------------------------位操作符-----------------------------
//
int main()
{
	int a = 3;
	int b = 5;
	////&  -  按(二进制)位与
	////
	//int c = a & b;
	//printf("%d", c);  //1
	////000000000000000000000000000000011
	////000000000000000000000000000000101
	////按位与的结果
	////000000000000000000000000000000001

	//  |   按(二进制)位或
	//int c = a | b;
	////000000000000000000000000000000011
	////000000000000000000000000000000101
	////按位或的结果
	////000000000000000000000000000000111
	//printf("%d", c); //7

	//  ^  按位(二进制位)异或
	//对应二进制位进行异或
	//对应二进制位相同为0，相异为1
	int c = a ^ b;
	//000000000000000000000000000000011
	//000000000000000000000000000000101
	//按位异或的结果
	//000000000000000000000000000000110
	printf("%d", c); //6
	return 0;
}































